banguyen5129/Heartrate-Monitor-Psoc/heartratemonitor.cydsn/Generated_Source/PSoC5/counter_reset.h
/*******************************************************************************
* File Name: counter_reset.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_counter_reset_H) /* CY_CONTROL_REG_counter_reset_H */
#define CY_CONTROL_REG_counter_reset_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} counter_reset_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    counter_reset_Write(uint8 control) ;
uint8   counter_reset_Read(void) ;

void counter_reset_SaveConfig(void) ;
void counter_reset_RestoreConfig(void) ;
void counter_reset_Sleep(void) ; 
void counter_reset_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define counter_reset_Control        (* (reg8 *) counter_reset_Sync_ctrl_reg__CONTROL_REG )
#define counter_reset_Control_PTR    (  (reg8 *) counter_reset_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_counter_reset_H */


/* [] END OF FILE */
